# UseHeatingCredits Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..UseHeatingCredits Property
EnergyDataSettings Class See Also
---
If true, Revit will use heating credits in the final load sum calculations. If false, Revit will ignore heating credits in the final load sum calculations.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool UseHeatingCredits { get; set; }
```

Visual Basic
---
```text
Public Property UseHeatingCredits As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool UseHeatingCredits {
	bool get ();
	void set (bool value);
}
```

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace